      * HELLO.COB GnuCOBOL FAQ example
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       PROCEDURE DIVISION.
       DISPLAY "Hello, world".
       STOP RUN.
